---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSet.ReverseIterator
source: html/802de994-b9f1-bee4-dffa-430b2dee38e1.htm
---
# Autodesk.Revit.DB.ConnectorSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ConnectorSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.